; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v10 ?v2)
             (pred_3 ?v1 ?v8)
             (pred_8 ?v10 ?v8)
             (pred_6 ?v11 ?v10 )
	     (pred_10 ?v10)
             (pred_4 ?v6)
             (pred_1 ?v1)
             (pred_12 ?v8)
             (pred_2 ?v10)
             (pred_11 ?v1)
             (pred_7 ?v10)
             (pred_9 ))



(:action op_4
:parameters (?v7 ?v3 ?v4 ?v5)
:precondition (and (pred_4 ?v7) (pred_4 ?v3) (pred_1 ?v4) (pred_12 ?v5)
          (pred_5 ?v7 ?v3) (pred_3 ?v4 ?v5)
                   (pred_8 ?v3 ?v5) (pred_10 ?v7) 
                   (pred_2 ?v3) (pred_11 ?v4))
:effect (and  (pred_7 ?v3) (not (pred_2 ?v3))))


(:action op_5
:parameters (?v7 ?v9)
:precondition (and (pred_4 ?v7) (pred_4 ?v9)
               (pred_10 ?v7) (pred_5 ?v7 ?v9) (pred_7 ?v9))
:effect (and (pred_10 ?v9) (not (pred_10 ?v7))))

(:action op_1
:parameters (?v7 ?v4)
:precondition (and (pred_4 ?v7) (pred_1 ?v4) 
                  (pred_10 ?v7) (pred_6 ?v4 ?v7) (pred_9 ))
:effect (and (pred_11 ?v4)
   (not (pred_6 ?v4 ?v7)) (not (pred_9 ))))


(:action op_3
:parameters (?v7 ?v13 ?v12)
:precondition (and (pred_4 ?v7) (pred_1 ?v13) (pred_1 ?v12)
                  (pred_10 ?v7) (pred_11 ?v12) (pred_6 ?v13 ?v7))
:effect (and (pred_11 ?v13) (pred_6 ?v12 ?v7)
        (not (pred_11 ?v12)) (not (pred_6 ?v13 ?v7))))

(:action op_2
:parameters (?v7 ?v4)
:precondition (and (pred_4 ?v7) (pred_1 ?v4) 
                  (pred_10 ?v7) (pred_11 ?v4))
:effect (and (pred_9 ) (pred_6 ?v4 ?v7) (not (pred_11 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_18 obj_11 obj_05 obj_20 obj_17 obj_06 obj_08 obj_03 obj_13 obj_09 obj_04 obj_16 obj_12 obj_01 obj_10 obj_02
    obj_19 obj_14
    obj_15 obj_07
    )

    (:init
       (pred_9)

       (pred_4 obj_18)
       (pred_4 obj_11)
       (pred_4 obj_05)
       (pred_4 obj_20)
       (pred_4 obj_17)
       (pred_4 obj_06)
       (pred_4 obj_08)
       (pred_4 obj_03)
       (pred_4 obj_13)
       (pred_4 obj_09)
       (pred_4 obj_04)
       (pred_4 obj_16)
       (pred_4 obj_12)
       (pred_4 obj_01)
       (pred_4 obj_10)
       (pred_4 obj_02)
       (pred_12 obj_19)
       (pred_12 obj_14)
       (pred_1 obj_15)
       (pred_1 obj_07)

       (pred_5 obj_18 obj_17)
       (pred_5 obj_18 obj_11)
       (pred_5 obj_11 obj_06)
       (pred_5 obj_11 obj_05)
       (pred_5 obj_11 obj_18)
       (pred_5 obj_05 obj_08)
       (pred_5 obj_05 obj_20)
       (pred_5 obj_05 obj_11)
       (pred_5 obj_20 obj_03)
       (pred_5 obj_20 obj_05)
       (pred_5 obj_17 obj_13)
       (pred_5 obj_17 obj_06)
       (pred_5 obj_17 obj_18)
       (pred_5 obj_06 obj_09)
       (pred_5 obj_06 obj_08)
       (pred_5 obj_06 obj_11)
       (pred_5 obj_06 obj_17)
       (pred_5 obj_08 obj_04)
       (pred_5 obj_08 obj_03)
       (pred_5 obj_08 obj_05)
       (pred_5 obj_08 obj_06)
       (pred_5 obj_03 obj_16)
       (pred_5 obj_03 obj_20)
       (pred_5 obj_03 obj_08)
       (pred_5 obj_13 obj_12)
       (pred_5 obj_13 obj_09)
       (pred_5 obj_13 obj_17)
       (pred_5 obj_09 obj_01)
       (pred_5 obj_09 obj_04)
       (pred_5 obj_09 obj_06)
       (pred_5 obj_09 obj_13)
       (pred_5 obj_04 obj_10)
       (pred_5 obj_04 obj_16)
       (pred_5 obj_04 obj_08)
       (pred_5 obj_04 obj_09)
       (pred_5 obj_16 obj_02)
       (pred_5 obj_16 obj_03)
       (pred_5 obj_16 obj_04)
       (pred_5 obj_12 obj_01)
       (pred_5 obj_12 obj_13)
       (pred_5 obj_01 obj_10)
       (pred_5 obj_01 obj_09)
       (pred_5 obj_01 obj_12)
       (pred_5 obj_10 obj_02)
       (pred_5 obj_10 obj_04)
       (pred_5 obj_10 obj_01)
       (pred_5 obj_02 obj_16)
       (pred_5 obj_02 obj_10)
       (pred_2 obj_12)
       (pred_2 obj_04)
       (pred_8  obj_12 obj_19)
       (pred_8  obj_04 obj_14)
       (pred_7 obj_18)
       (pred_7 obj_11)
       (pred_7 obj_05)
       (pred_7 obj_20)
       (pred_7 obj_17)
       (pred_7 obj_06)
       (pred_7 obj_08)
       (pred_7 obj_03)
       (pred_7 obj_13)
       (pred_7 obj_09)
       (pred_7 obj_16)
       (pred_7 obj_01)
       (pred_7 obj_10)
       (pred_7 obj_02)

       (pred_3  obj_15 obj_19)
       (pred_3  obj_07 obj_14)
       (pred_6 obj_15 obj_16)
       (pred_6 obj_07 obj_11)
       (pred_10 obj_06)
    )

    (:goal (and
       (pred_6 obj_15 obj_12)
    ))
(:constraints
  (always (not (pred_10 obj_01)))
)
)

; plan
1. (op_5 obj_06 obj_08)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_08)
   goals met: 0 of 1
2. (op_5 obj_08 obj_03)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_03)
   goals met: 0 of 1
3. (op_5 obj_03 obj_16)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_16)
   goals met: 0 of 1
4. (op_1 obj_16 obj_15)
   deleted: (pred_6 obj_15 obj_16) (pred_9)
   added: (pred_11 obj_15)
   goals met: 0 of 1
5. (op_5 obj_16 obj_03)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_03)
   goals met: 0 of 1
6. (op_5 obj_03 obj_08)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_08)
   goals met: 0 of 1
7. (op_5 obj_08 obj_06)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_06)
   goals met: 0 of 1
8. (op_5 obj_06 obj_17)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_17)
   goals met: 0 of 1
9. (op_5 obj_17 obj_13)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_13)
   goals met: 0 of 1
10. (op_4 obj_13 obj_12 obj_15 obj_19)
   deleted: (pred_2 obj_12)
   added: (pred_7 obj_12)
   goals met: 0 of 1
11. (op_5 obj_13 obj_12)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_12)
   goals met: 0 of 1
12. (op_2 obj_12 obj_15)
   deleted: (pred_11 obj_15)
   added: (pred_9) (pred_6 obj_15 obj_12)
   goals met: 1 of 1
